
## Plan Result

[CI link](https://github.com/kazeusagi/my-chatbot-infra/actions/runs/14397442196)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.sqs.aws_sqs_queue.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.sqs.aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "dev-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + test = "arn:aws:iam::790840705731:role/GithubActionsOIDCRole"
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/kazeusagi/my-chatbot-infra/issues/13/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":13,"Program":"tfcmt","SHA1":"2560a1828e2e4b8dd6359ae143382081f6261d09","Vars":{},"WorkflowName":"Plan Dev"} -->